---
kind: type
id: T:Autodesk.Revit.DB.Curve
zh: 曲线
source: html/400cc9b6-9ff7-de85-6fd8-c20002209d25.htm
---
# Autodesk.Revit.DB.Curve

**中文**: 曲线

A parametric curve.

## Syntax (C#)
```csharp
public class Curve : GeometryObject
```

## Remarks
The concrete curves are defined by parametric equations. If the curve is
bound, it is only defined for an interval in parameterization. Otherwise, it is
defined for all values of the parameter.